{
    "profile": {
        "name": "Belay Sirak",
        "bio": "I am a full-stack developer with more than 3 years of experience in both frontend and backend development. I have a strong foundation in building dynamic, user-focused web applications and a passion for creating seamless, responsive designs. I’m committed to continuously expanding my technical skills and adapting to new tools and practices to deliver innovative and effective solutions in an ever-evolving field.",
        "resume_url": "/belay_cv.pdf",
        "email": "belay1.sirak2.tsige3@gmail.com",
        "url":"https://www.belay-sirak.tsige.com",
        "image": "/images/pro.jpg",
        "accounts": {
            "github": "https://github.com/belay09",
            "linkedin": "https://www.linkedin.com/in/belay-sirak-801008224/"

        }
    },
    "education": {
        "institution": "Bahir Dar University",
        "icon": "material-symbols:school",
        "degree": "Bachelor's degree in Information Technology (2019-2023)",
        "thesis": "Thesis: Web Application called 'Chewata Social Media'",
        "subjects": [
            "Advanced Web Programming",
            "Database Management",
            "Data Structures and Algorithms",
            "Software Engineering"
        ]
    },
    "technical_skills": [
        {
            "icon": "material-symbols:web",
            "category": "Web Development",
            "description": "I specialize in creating dynamic web applications, managing frontend interfaces with modern technologies, and building responsive designs.",
            "skills": [
                "Vue.js",
                "Nuxt.js",
                "React.js",
                "Tailwind CSS",
                "HTML5",
                "CSS3",
                "JavaScript"
            ]
        },
        {
            "icon": "mdi:database-cog",
            "category": "Backend Development",
            "description": "I have experience building and integrating backend systems using Node.js and databases like MongoDB and PostgreSQL.",
            "skills": [
                "Node.js",
                "ExpressJS",
                "Hasura GraphQL",
                "MongoDB",
                "PostgreSQL"
            ]
        }
    ],
    "certifications": [
    {
      "title": "Certificate in Full-Stack Development",
      "url": "https://www.udemy.com/certificate/UC-adf476c0-d890-4fe5-8c65-9d7cb39691b7",
      "institution": "Udemy",
      "description": "Full Stack Web Development Course covering MERN stack, deployment, and CI/CD.",
      "date": "January 2024"
    }
  ],
    "work_experience": [
        {
            "icon": "ic:sharp-home-work",
            "title": "Full Stack Developer at Minab IT Solutions",
            "period": "February 2022 - Present",
            "jobdesk": [
                "Developed and maintained the frontend of a song management application using Vue.js and Nuxt.js.",
                "Integrated backend services with GraphQL using Hasura, and managed REST APIs with Node.js.",
                "Collaborated in a team to ensure seamless integration between frontend and backend services."
            ]
        },
        {
            "icon": "ic:sharp-home-work",
            "title": "Frontend Developer at Freelance",
            "period": "January 2022 - Present",
            "jobdesk": [
                "Built and maintained responsive websites for various clients using Vue.js, Tailwind CSS, and Nuxt.js.",
                "Provided ongoing support and maintenance to ensure websites remain up-to-date and optimized.",
                "Collaborated with backend developers to integrate APIs into frontend applications."
            ]
        }
    ],
    
        "projects": [
            {

                "title": "Hahu Jobs",
                "description": "Hahu Jobs is a job search platform that connects job seekers with employers. It offers a user-friendly interface for job seekers to search for jobs, apply, and manage their applications. Employers can post job listings, review applications, and manage their hiring process. I worked on the frontend to create a seamless user experience, optimize performance, and ensure compatibility across devices.",
                "image": "/images/projects/hahu.png",
                "tools": {
                    "vuejs": "https://vuejs.org/",
                    "tailwindcss": "https://tailwindcss.com/",
                  "nuxtdotjs": "https://nuxtjs.org/",
                  "graphql": "https://graphql.org/",
                  "javascript": "https://developer.mozilla.org/en-US/docs/Web/JavaScript"
    
                },
                "url": "https://hahu.jobs/"
              },
          {
            "title": "Hahu Muya",
            "description": "Muya offers a diverse set of technical and soft skills training for students, jobseekers and professionals alike. It offers capacity building programs of different types and levels partnering with a diverse set of development partners.",
            "image": "/images/projects/muya.jpg",
            "tools": {
              "vuejs": "https://vuejs.org/",
              "tailwindcss": "https://tailwindcss.com/",
              "nuxtdotjs": "https://nuxtjs.org/",
              "graphql": "https://graphql.org/"

            },
            "url": "https://muya.hahu.jobs/en"
          },
          
          {
            "title": "Darius’ Fight for Justice",
            "description": "This website is dedicated to raising awareness and support for Darius, an 11-year-old boy who has suffered from abuse due to a failing legal system in Poland. It highlights the urgent need for judicial reform to protect vulnerable children. Through compelling storytelling, it sheds light on Darius' struggle and the systemic failures that affect countless children in Poland. The site provides information on how visitors can help, including donating, sharing the story, and supporting legal efforts to take the case to the European Court of Human Rights. Together, we can make a difference.",
            "image": "/images/projects/dari.png",
            "tools": {
                "laravel": "https://laravel.com/",
                "tailwindcss": "https://tailwindcss.com/",
                "css3": "https://developer.mozilla.org/en-US/docs/Web/CSS",
                "html5": "https://developer.mozilla.org/en-US/docs/Web/HTML"

            },
            "url": "https://dariusbehi.com/"
          },
          {
            "title": "Sheger Gebeta",
            "description": "Sheger Gebeta is a comprehensive platform designed to connect hospitality businesses, such as hotels, cafes, and restaurants, with customers, similar to Booking.com. I worked on the admin panel to manage places (e.g., hotels, restaurants), create entities, configure settings, and handle billing. The platform allows seamless creation and management of businesses, streamlining administrative tasks while enabling dynamic data updates and customer engagement.",
            "image": "/images/projects/sheger.png",
            "tools": {
                "vuejs": "https://vuejs.org/",
                "tailwindcss": "https://tailwindcss.com/",
              "nuxtdotjs": "https://nuxtjs.org/",
              "graphql": "https://graphql.org/"

            },
            "url": "https://staging.admin.shegergebeta.com/"
          },
         
          {
            "title": "plan International",
            "description": "Project description. Developed a user-friendly website for a childcare franchise model to empower young mothers to start home-based childcare services. Focused on responsive design, intuitive navigation, and interactive features like application forms and scheduling tools. Ensured seamless integration with backend systems and conducted user testing to refine the interface. The project provided mothers with a sustainable business opportunity, increased childcare availability, and supported community needs through a scalable, accessible platform.",
            "image": "/images/projects/plan.png",
            "tools": {
                "vuejs": "https://vuejs.org/",
                "tailwindcss": "https://tailwindcss.com/",
              "nuxtdotjs": "https://nuxtjs.org/",
              "graphql": "https://graphql.org/",
              "javascript": "https://developer.mozilla.org/en-US/docs/Web/JavaScript"
            },
            "url": "https://www.uymp.org"
          }
        ]
}
